app/controllers/cat_rental_requests_controller.rb

SELECT "cat_rental_requests".* FROM "cat_rental_requests"
---
  def index
    @cat_rental_requests = CatRentalRequest.all

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @cat_rental_request = CatRentalRequest.find(params[:id])

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 3], ["start_date", "2018-10-10"], ["end_date", "2018-10-13"], ["created_at", "2018-09-11 18:33:21.935232"], ["updated_at", "2018-09-11 18:33:21.935232"]]
---
  def create
    @cat_rental_request = CatRentalRequest.new(cat_rental_request_params)

    if @cat_rental_request.save!

SELECT "cats".* FROM "cats"
---
  def new
    @cats = Cat.all

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def change_status(id, status)
    status = status.downcase.to_sym
    status_mapping = {
      approved: 'approve',
      denied: 'deny'
    }

    cat_rental_request = CatRentalRequest.find(id)