app/models/cat_rental_request.rb

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2018-09-11 19:13:49.516743"], ["id", 5]]
UPDATE "cat_rental_requests" SET "status" = 'DENIED' WHERE "cat_rental_requests"."cat_id" = $1 AND ((start_date BETWEEN '2018-09-15' AND '2018-09-21') OR (end_date BETWEEN '2018-09-15' AND '2018-09-21')) AND "cat_rental_requests"."id" != $2 AND "cat_rental_requests"."status" = $3  [["cat_id", 3], ["id", 5], ["status", "PENDING"]]
---
  def approve!
    CatRentalRequest.transaction do
      CatRentalRequest.find(self.id).update!(status: 'APPROVED')
      overlapping_pending_requests.update_all(status: 'DENIED')

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2018-09-11 19:48:22.234645"], ["id", 1]]
---
  def deny!
    CatRentalRequest.find(self.id).update!(status: 'DENIED')